[{
    name: "襄阳供电公司",
    "id": 1,
    "children": [{
      name: "谷城县供电公司",
      "id": 10,
      "children": [{
        name: "谷城营销部",
        "id": 1010,
        "children":[
          {
            name: "谷城营销部1",
            "id": 101010,
            
            "children":[
              {
                name:"紫金供电所",
                "id":10101010,
                "children":[
                  {
                    name:"紫金运维班",
                    "id":1010101010,
                    "children":[
                      {
                        name:"1楼南区",
                        "id":101010101010,
                        "devId":1,
                        "devNum":'4600585133'
                      }
                    ]
                  }
                ]
              },{
                name:"庙滩供电所",
                "id":10101020,
                "children":[
                  {
                    name:"庙滩运维班",
                    "id":1010102010,
                  }
                ]
              },{
                name:"茨河供电所",
                "id":10101030,
                "children":[
                  {
                    name:"茨河运维班",
                    "id":1010103010,
                  }
                ]
              },{
                name:"北河供电所",
                "id":10101040,
                "children":[
                  {
                    name:"北河运维班",
                    "id":1010104010,
                  }
                ]
              }
            ]
          },
        ]
      }, {
        name: "开关站",
        "id": 1020,
        "children":[
          {
            name: "当铺开关站",
            "id": 102010,
            "children":[
              {
                name: "接地网",
                "id": 10201010,
              },{
                name: "配电电能质量在线监测装置",
                "id": 10201020,
              },{
                name: "高压部分",
                "id": 10201030,
              }
            ]
          },{
            name: "黄畈开关站",
            "id": 102020,
            "children":[
              {
                name:"接地网",
               " id":10202010
              },{
                name:"配电电能质量在线监测装置",
                "id":10202020
              },{
                name:"高压部分",
                "id":10202030,
                "children":[
                  {
                    name:"郭峪线黄56",
                    "id":1020203010,
                  },
                  {
                    name:"黄51+",
                    "id":1020203020,
                  },
                ]
              }
            ]
          },{
            name: "熊营开关站",
            "id": 102030,
          },{
            name: "配电站",
            "id": 102040,
          }
        ]
      }, {
        name: "配电室",
        "id": 1030,
      }, {
       name: "箱式变电站",
        "id": 1040,
      }]
    },{
      name:"襄阳市襄州区供电公司",
      "id":20,
      "children":[
        {
          name: "开关站",
         "id": 2010,
          "children":[
            {
             name: "10kv碧桂园公变开闭所",
              "id": 201010,
            },{
             name: "10kv都会山居民开闭所",
              "id": 201020,
            },
            {
             name: "10kv和信北郡闭所",
              "id": 201030,
            }
          ]
        },{
          name:"配电室",
          "id":2020,
          "children":[
            {
             name:"10kv光瑞汽车零部分新增4#配电室",
             "id":202010
            },{
              name:"10kv上品百合园1#居民配电室#配电室",
              "id":202020
            },{
             name:"10kv上品百合园2#居民配电室#配电室",
             "id":202030
            }
          ]
        }
      ]
    },{
      name:"国网宜城市供电公司",
      "id":30,
      "children":[
        {
          name: "开关站",
          "id": 3010,
          "children":[
            {
              name: "孔湾开关站",
             "id": 301010,
            },{
              name: "李垱开关站",
              "id": 301020,
            },
            {
              name: "铁湖开关站",
              "id": 201030,
            }
          ]
        },{
          name:"配电室",
          "id":3020,
          "children":[
            {
              name:"康桥国际2#配电室#配电室",
              "id":302010
            },{
             " name":"民心佳园1#配电室",
              "id":302020
            },{
             name:"民心佳园2#配电室",
              "id":302030
            }
          ]
        }
      ]
    }]
}]
